OSCCAR/tutorials/multiphase/twoPhaseEulerFoam/RAS/fluidisedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles 0
);

regions
(
    boxToCell
    {
        box ( 0 0 -0.1 ) ( 0.15 0.5 0.1 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.45
            volScalarFieldValue alpha.particles 0.55
        );
    }
);


// ************************************************************************* //
